Repository: lynnedong/LynneTest
Catalog: VSCode/*/vs_editor_contrib.xlf
Languages: fr

# transposeLetters.label
source: Transpose Letters
fr: Trans1-CrowdIn-LynneD

# caret.moveLeft
source: Move Caret Left
fr: Trans2-CrowdIn-LynneD-Github-LynnedongMS

# caret.moveRight
source: Move Caret Right
fr: Trans3-LynneD-Crowdin-Translated

source: Cursor Undo
fr: Trans4-github-lynneMSo

source: Cursor Redo
fr: cursor redo-lynned

# comment.line
source: Toggle Line Comment
fr: Activer/désactiver le commentaire de ligne-LynneD

# miToggleLineComment
source: &&Toggle Line Comment
fr: &&Activer/désactiver le commentaire de ligne-LynneD

# comment.line.add
source: Add Line Comment
fr: Translation-LynneMS

# comment.line.remove
source: Remove Line Comment
fr: Supprimer le commentaire de ligne

# comment.block
source: Toggle Block Comment
fr: Activer/désactiver le commentaire du bloc

# miToggleBlockComment
source: Toggle &&Block Comment
fr: Basculer &&Bloquer les commentaires

# forceRetokenize
source: Developer: Force Retokenize
fr: Développeur : Force Retokenize

# EditorFontZoomIn.label
source: Editor Font Zoom In
fr: Zoom avant de la fonte de l'éditeur

# EditorFontZoomOut.label
source: Editor Font Zoom Out
fr: Zoom arrière de la police de l'éditeur

# EditorFontZoomReset.label
source: Editor Font Zoom Reset
fr: Réinitialisation du zoom de la police de l'éditeur

# parameterHints.trigger.label
source: Trigger Parameter Hints
fr: Indications du paramètre de déclenchement

# toggle.tabMovesFocus
source: Toggle Tab Key Moves Focus
fr: Activer/désactiver les raccourcis clavier d'onglet

# toggle.tabMovesFocus.on
source: Pressing Tab will now move focus to the next focusable element
fr: Appuyer sur l'onglet déplacera maintenant le focus vers l'élément ciblable suivant

# toggle.tabMovesFocus.off
source: Pressing Tab will now insert the tab character
fr: Appuyer sur Onglet va maintenant insérer le caractère Onglet

# overviewRulerBracketMatchForeground
source: Overview ruler marker color for matching brackets.
fr: Aperçu de la couleur du marqueur de la règle pour les accolades correspondantes.

# smartSelect.jumpBracket
source: Go to Bracket
fr: Aller à la parenthèse

# smartSelect.selectToBracket
source: Select to Bracket
fr: Sélectionner pour la parenthèse

# miGoToBracket
source: Go to &&Bracket
fr: Aller à &&Pile

# actions.clipboard.cutLabel
source: Cut
fr: Couper

# actions.clipboard.copyLabel
source: Copy
fr: Copie

# miCopy
source: &&Copy
fr: &&Copier

# actions.clipboard.pasteLabel
source: Paste
fr: Coller

# miPaste
source: &&Paste
fr: &&Coller

# actions.clipboard.copyWithSyntaxHighlightingLabel
source: Copy With Syntax Highlighting
fr: Copier avec la coloration syntaxique

# action.showContextMenu.label
source: Show Editor Context Menu
fr: Afficher le menu contextuel de l'éditeur

# formatDocument.label
source: Format Document
fr: Formater le document

# formatSelection.label
source: Format Selection
fr: Sélection du format

# InPlaceReplaceAction.previous.label
source: Replace with Previous Value
fr: Remplacer par la valeur précédente

# InPlaceReplaceAction.next.label
source: Replace with Next Value
fr: Remplacer par la valeur suivante

source: Show Definition Preview Hover
fr: Afficher l'aperçu de la définition en survolant

source: No result.
fr: Aucun résultat.

# resolveRenameLocationFailed
source: An unknown error occurred while resolving rename location
fr: Une erreur inconnue s'est produite lors de la résolution de l'emplacement du renommage

# label_Duplicated1
source: Renaming '{0}'
fr: Renommage de '{0}'

# aria
source: Successfully renamed '{0}' to '{1}'. Summary: {2}
fr: Renommé avec succès '{0}' en '{1}'. Résumé: {2}

# rename.failedApply
source: Rename failed to apply edits
fr: Échec du renommage des modifications

# rename.failed
source: Rename failed to compute edits
fr: Le renommage a échoué lors du calcul des modifications

# rename.label
source: Rename Symbol
fr: Renommer le symbole

# enablePreview
source: Enable/disable the ability to preview changes before renaming
fr: Activer/désactiver la possibilité de prévisualiser les modifications avant de renommer

# smartSelect.expand
source: Expand Selection
fr: Développer la sélection

# miSmartSelectGrow
source: &&Expand Selection
fr: &&Développer la sélection

# smartSelect.shrink
source: Shrink Selection
fr: Réduire la sélection

# miSmartSelectShrink
source: &&Shrink Selection
fr: &&Réduire la sélection

# multipleResults
source: Click to show {0} definitions.
fr: Cliquez pour afficher les définitions de {0}.
